HuangShW/mymatter/esp32/main/main.cpp
Protocols::InteractionModel::Status HandleWriteOnOffAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer)
{
    ChipLogProgress(DeviceLayer, "HandleWriteOnOffAttribute: attrId=%" PRIu32, attributeId);

    VerifyOrReturnError((attributeId == OnOff::Attributes::OnOff::Id) && dev->IsReachable(),
                        Protocols::InteractionModel::Status::Failure);
    dev->SetOnOff(*buffer == 1);
    return Protocols::InteractionModel::Status::Success;
}

Protocols::InteractionModel::Status HandleReadLevelControlAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer,
                                                                   uint16_t maxReadLength)
{
    using namespace LevelControl::Attributes;
    ChipLogProgress(DeviceLayer, "HandleReadLevelControlAttribute: attrId=%" PRIu32 ", maxReadLength=%u", attributeId, maxReadLength);

    if (attributeId == FeatureMap::Id)
    {
        if (maxReadLength >= 4)
        {
            // Set FeatureMap for Lighting devices: kOnOff (0x01) + kLighting (0x02) = 0x03
            uint32_t featureMap = static_cast<uint32_t>(LevelControl::Feature::kOnOff) |
                                  static_cast<uint32_t>(LevelControl::Feature::kLighting);
            memcpy(buffer, &featureMap, sizeof(featureMap));
            return Protocols::InteractionModel::Status::Success;
        }
    }
    if (attributeId == CurrentLevel::Id)
    {
        if (maxReadLength >= 1)
        {
            // CurrentLevel is nullable uint8, but we'll always return a valid value
            uint8_t currentLevel = dev->GetCurrentLevel();
            *buffer = currentLevel;
            ChipLogProgress(DeviceLayer, "HandleReadLevelControlAttribute: CurrentLevel=%d", currentLevel);
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == RemainingTime::Id)
    {
        if (maxReadLength >= 2)
        {
            // RemainingTime - we don't support transitions, so always 0
            uint16_t remainingTime = 0;
            memcpy(buffer, &remainingTime, sizeof(remainingTime));
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == MinLevel::Id)
    {
        if (maxReadLength >= 1)
        {
            *buffer = dev->GetMinLevel();
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == MaxLevel::Id)
    {
        if (maxReadLength >= 1)
        {
            *buffer = dev->GetMaxLevel();
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == Options::Id)
    {
        if (maxReadLength >= 1)
        {
            // Options bitmap - no special options supported
            *buffer = 0;
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == OnOffTransitionTime::Id)
    {
        if (maxReadLength >= 2)
        {
            // OnOffTransitionTime - no transition supported, so 0
            uint16_t transitionTime = 0;
            memcpy(buffer, &transitionTime, sizeof(transitionTime));
            ChipLogProgress(DeviceLayer, "HandleReadLevelControlAttribute: OnOffTransitionTime=0");
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == OnLevel::Id)
    {
        if (maxReadLength >= 1)
        {
            // OnLevel - level to use when turning on, null means use previous level
            // We'll return null (0xFF) to indicate using previous level
            *buffer = 0xFF;
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == StartUpCurrentLevel::Id)
    {
        if (maxReadLength >= 1)
        {
            // StartUpCurrentLevel - null means use previous level on startup
            *buffer = 0xFF;
            return Protocols::InteractionModel::Status::Success;
        }
    }
    else if (attributeId == ClusterRevision::Id)
    {
        if (maxReadLength >= 2)
        {
            uint16_t rev = 6; // Level Control cluster revision 6
            memcpy(buffer, &rev, sizeof(rev));
            return Protocols::InteractionModel::Status::Success;
        }
    }

    ChipLogProgress(DeviceLayer, "HandleReadLevelControlAttribute: Unsupported attribute %" PRIu32, attributeId);
    return Protocols::InteractionModel::Status::UnsupportedAttribute;
}

Protocols::InteractionModel::Status HandleWriteLevelControlAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer)
{
    using namespace LevelControl::Attributes;
    ChipLogProgress(DeviceLayer, "HandleWriteLevelControlAttribute: attrId=%" PRIu32, attributeId);

    VerifyOrReturnError(dev->IsReachable(), Protocols::InteractionModel::Status::Failure);
    
    if (attributeId == CurrentLevel::Id)
    {
        uint8_t level = *buffer;
        ChipLogProgress(DeviceLayer, "HandleWriteLevelControlAttribute: Received level %d", level);

        // Handle special case: 0 means "undefined level", map to minimum level
        // This happens when SDK's range checking limits the level to 0 due to incorrect min/max values
        // if (level == 0)
        // {
        //     level = dev->GetMinLevel();
        //     ChipLogProgress(DeviceLayer, "HandleWriteLevelControlAttribute: Mapped level 0 to minimum %d", level);
        //     ChipLogProgress(DeviceLayer, "Note: This suggests SDK Level Control state may not be properly initialized");
        // }

        // Validate level range (1-254)
        if (level > 254)
        {
            ChipLogProgress(DeviceLayer, "HandleWriteLevelControlAttribute: Invalid level %d", level);
            return Protocols::InteractionModel::Status::ConstraintError;
        }
        ChipLogProgress(DeviceLayer, "HandleWriteLevelControlAttribute: Setting level to %d", level);
        dev->SetLevel(level);
        
        return Protocols::InteractionModel::Status::Success;
    }
    else if (attributeId == Options::Id)
    {
        // Options attribute is writable but we don't support any options
        return Protocols::InteractionModel::Status::Success;
    }
    else if (attributeId == OnOffTransitionTime::Id)
    {
        // OnOffTransitionTime is writable but we don't support transitions
        return Protocols::InteractionModel::Status::Success;
    }
    else if (attributeId == OnLevel::Id)
    {
        // OnLevel is writable, store the value for potential future use
        // For now, we'll just accept it without storing
        return Protocols::InteractionModel::Status::Success;
    }

    return Protocols::InteractionModel::Status::Failure;
}

Protocols::InteractionModel::Status emberAfExternalAttributeReadCallback(EndpointId endpoint, ClusterId clusterId,
                                                                         const EmberAfAttributeMetadata * attributeMetadata,
                                                                         uint8_t * buffer, uint16_t maxReadLength)
{
    uint16_t endpointIndex = emberAfGetDynamicIndexFromEndpoint(endpoint);

